In [2]:
import sqlite3
import pandas as pan

In [4]:
connection=sqlite3.connect('C:/SQLite/sqlite-tools-win32-x86-3430000/escuelita.db');

In [9]:
dataFrame=pan.read_sql_query('SELECT * FROM alumno',connection);

In [10]:
dataFrame

   id     nombre
0   1    Juanito
1   2      Maria
2   3      Pedro
3   4     Camila
4   5      Jesus
5   6     Donald
6   7  Gertrudis